-- MySQL dump 10.13  Distrib 5.5.31, for debian-linux-gnu (i686)
--
-- Host: localhost    Database: bus4
-- ------------------------------------------------------
-- Server version	5.5.31-0+wheezy1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `class`
--

DROP TABLE IF EXISTS `v_sector`;
DROP TABLE IF EXISTS `v_sub_sector`;
DROP TABLE IF EXISTS `v_group`;


DROP TABLE IF EXISTS `class`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `class` (
  `ID` int(11) NOT NULL AUTO_INCREMENT,
  `level` int(11) DEFAULT NULL,
  `name` text,
  `yomi` text,
  KEY `ID` (`ID`,`level`,`name`(6),`yomi`(6))
) ENGINE=MyISAM AUTO_INCREMENT=299 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `class`
--

LOCK TABLES `class` WRITE;
/*!40000 ALTER TABLE `class` DISABLE KEYS */;
INSERT INTO `class` VALUES (1,1,'駅・交通機関',''),(2,2,'駅',''),(3,2,'空港',''),(4,2,'フェリー・旅客船',''),(5,2,'交差点',''),(6,2,'港・漁港・港湾',''),(7,2,'バス停',''),(8,2,'その他(駅・交通機関)',''),(9,1,'公共施設・暮らし',''),(10,2,'官公庁',''),(11,2,'都道府県庁',''),(12,2,'市役所・区役所・町村役場',''),(13,2,'警察署',''),(14,2,'保健所',''),(15,2,'消防署',''),(16,2,'税務署・会計事務所',''),(17,2,'法務局・法律事務所',''),(18,2,'裁判所',''),(19,2,'図書館',''),(20,2,'ハローワーク',''),(21,2,'不動産',''),(22,2,'公民館・集会所',''),(23,2,'電気・ガス・水道・電話',''),(24,2,'報道機関',''),(25,2,'その他(公共施設・暮らし)',''),(26,1,'医療・福祉',''),(27,2,'病院・医院・診療所',''),(28,2,'歯科医院',''),(29,2,'動物病院',''),(30,2,'接骨・針灸院',''),(31,2,'介護・福祉サービス',''),(32,2,'その他(医療・福祉)',''),(33,1,'学校・習い事',''),(34,2,'大学・短期大学',''),(35,2,'高等専門学校',''),(36,2,'高校',''),(37,2,'中学校',''),(38,2,'小学校',''),(39,2,'幼稚園・保育園',''),(40,2,'専修・専門学校',''),(41,2,'語学学校・教室',''),(42,2,'塾・予備校',''),(43,2,'文科系スクール',''),(44,2,'スポーツ系スクール',''),(45,2,'ペットスクール',''),(46,2,'その他(学校・習い事)',''),(47,1,'金融機関',''),(48,2,'都市銀行',''),(49,2,'地方銀行・その他銀行',''),(50,2,'信用金庫・信用組合',''),(51,2,'証券・保険会社',''),(52,2,'消費者金融',''),(53,2,'ATM',''),(54,2,'郵便局',''),(55,2,'農協',''),(56,2,'その他(金融機関)',''),(57,1,'スポーツ施設',''),(58,2,'ゴルフ場',''),(59,2,'野球場・競技場',''),(60,2,'スキー場',''),(61,2,'ゴルフ練習場',''),(62,2,'スケート場',''),(63,2,'マリーナ',''),(64,2,'テニスコート',''),(65,2,'バッティングセンター',''),(66,2,'サッカー場',''),(67,2,'体育館',''),(68,2,'フィットネスクラブ',''),(69,2,'サーキット場',''),(70,2,'その他(スポーツ施設)',''),(71,1,'レジャー・遊ぶ',''),(72,2,'レジャー',''),(73,3,'公園・緑地',''),(74,3,'キャンプ場',''),(75,3,'オートキャンプ場',''),(76,3,'ホール・国際展示場',''),(77,3,'海水浴場',''),(78,3,'プール',''),(79,3,'釣り堀',''),(80,3,'レンタサイクル',''),(81,3,'地ワイン・地ビール工房',''),(82,3,'牧場',''),(83,3,'灯台',''),(84,2,'遊ぶ',''),(85,3,'遊園地',''),(86,3,'カラオケ',''),(87,3,'ライブハウス',''),(88,3,'ゲームセンター',''),(89,3,'クラブ・ディスコ',''),(90,3,'ボーリング場',''),(91,3,'ビリヤード',''),(92,2,'リフレッシュ',''),(93,3,'温泉',''),(94,3,'サウナ・ヘルスセンター',''),(95,3,'リゾート施設',''),(96,2,'見る・観る',''),(97,3,'動物園',''),(98,3,'植物園',''),(99,3,'水族館',''),(100,3,'映画館',''),(101,3,'博物館・資料館',''),(102,3,'美術館',''),(103,3,'天文台・プラネタリウム',''),(104,3,'劇場',''),(105,2,'ギャンブル',''),(106,3,'競馬・競輪・競艇',''),(107,3,'オートレース場',''),(108,3,'パチンコ',''),(109,3,'雀荘',''),(110,2,'占い',''),(111,2,'マンガ喫茶',''),(112,2,'ペットの泊まれるキャンプ場',''),(113,2,'ドックラン・スパ',''),(114,2,'その他(レジャー・遊ぶ)',''),(115,1,'宿泊',''),(116,2,'ホテル',''),(117,2,'ビジネスホテル',''),(118,2,'旅館・民宿',''),(119,2,'カプセルホテル',''),(120,2,'ペンション',''),(121,2,'公共宿舎',''),(122,2,'ペットの泊まれる宿',''),(123,2,'その他(宿泊)',''),(124,1,'グルメ',''),(125,2,'ファーストフード',''),(126,2,'ファミリーレストラン',''),(127,2,'和食系',''),(128,3,'和食',''),(129,3,'うどん・そば',''),(130,3,'寿司',''),(131,3,'お好み焼・もんじゃ・たこ焼',''),(132,3,'とんかつ・串かつ料理',''),(133,3,'鳥料理',''),(134,2,'洋食',''),(135,2,'中華',''),(136,2,'ラーメン',''),(137,2,'カレー',''),(138,2,'カフェ・喫茶・甘味処',''),(139,2,'イタリアン',''),(140,2,'焼肉・韓国料理',''),(141,2,'フレンチ',''),(142,2,'ステーキハウス',''),(143,2,'お酒',''),(144,3,'居酒屋',''),(145,3,'ビアレストラン・ガーデン',''),(146,3,'バー・レストランバー',''),(147,3,'スナック・クラブ・パブ',''),(148,2,'エスニック',''),(149,2,'宅配・テイクアウト',''),(150,2,'ペットの入れるレストラン',''),(151,2,'その他(グルメ)',''),(152,1,'ショッピング',''),(153,2,'デパート・駅ビル',''),(154,2,'アウトレット・ショッピングモール',''),(155,2,'ファッション・美容',''),(156,3,'メガネ',''),(157,3,'靴・衣料品',''),(158,3,'理容室・美容室',''),(159,3,'エステ・ネイルサロン',''),(160,3,'アクセサリー',''),(161,3,'ランジェリー',''),(162,2,'生活',''),(163,3,'ディスカウントショップ',''),(164,3,'コンビニ',''),(165,3,'スーパー',''),(166,3,'家電・パソコン',''),(167,3,'ホームセンター',''),(168,3,'薬局・ドラックストア',''),(169,3,'リサイクルショップ',''),(170,3,'文具雑貨',''),(171,3,'携帯電話ショップ',''),(172,3,'クリーニング',''),(173,3,'介護・福祉用品',''),(174,2,'飲食',''),(175,3,'酒屋・酒蔵',''),(176,3,'お菓子・ケーキパン',''),(177,3,'市場',''),(178,3,'食料品',''),(179,2,'趣味',''),(180,3,'書店',''),(181,3,'スポーツ用品',''),(182,3,'民芸・工芸品',''),(183,3,'レンタル',''),(184,3,'インテリア',''),(185,3,'バイク・自転車',''),(186,3,'花屋・園芸',''),(187,3,'CD・レコード',''),(188,3,'おもちゃ',''),(189,3,'ペットショップ',''),(190,3,'カメラ・写真',''),(191,3,'楽器店',''),(192,3,'アウトドア用品',''),(193,3,'アンティーク',''),(194,2,'お土産・物産',''),(195,2,'その他(ショッピング)',''),(196,1,'地名',''),(197,2,'山・山岳',''),(198,2,'湖・沼・池',''),(199,2,'島',''),(200,2,'橋・トンネル・ダム',''),(201,2,'住宅・団地',''),(202,2,'ビル・マンション',''),(203,2,'その他(地名)',''),(204,1,'企業',''),(205,2,'水産・農林業',''),(206,2,'鉱業',''),(207,2,'建設業',''),(208,2,'食料品',''),(209,2,'パルプ・紙',''),(210,2,'化学',''),(211,2,'石油・石炭製品',''),(212,2,'ゴム製品',''),(213,2,'ガラス・土石製品',''),(214,2,'鉄鋼',''),(215,2,'非鉄金属',''),(216,2,'金属製品',''),(217,2,'機械',''),(218,2,'電気機器',''),(219,2,'輸送用機器',''),(220,2,'精密機器',''),(221,2,'その他製品',''),(222,2,'卸売業・小売業',''),(223,2,'金融業',''),(224,2,'不動産業',''),(225,2,'陸運業',''),(226,2,'海運業',''),(227,2,'空運業',''),(228,2,'倉庫・運輸関連業',''),(229,2,'通信業',''),(230,2,'電気・ガス業',''),(231,2,'サービス業',''),(232,2,'医薬品',''),(233,2,'その他(企業)',''),(234,1,'観光・イベント',''),(235,2,'お祭り',''),(236,2,'花見',''),(237,2,'潮干狩り',''),(238,2,'果物狩り',''),(239,2,'花火',''),(240,2,'フリーマーケット',''),(241,2,'名所・旧跡',''),(242,2,'紅葉',''),(243,2,'ホタル',''),(244,2,'夜景',''),(245,2,'風光明媚',''),(246,2,'星空',''),(247,2,'観光案内・バス',''),(248,2,'旅行代理店',''),(249,2,'ペットと行ける観光名所',''),(250,2,'名産物・特産物',''),(251,2,'伝統工芸',''),(252,2,'その他(観光・イベント)',''),(253,1,'無線スポット',''),(254,2,'Mzone',''),(255,2,'HOTSPOT',''),(256,2,'Mフレッツ',''),(257,2,'フレッツ・スポット',''),(258,2,'Yahoo!BBモバイル',''),(259,2,'無線LAN倶楽部',''),(260,2,'BizPortal',''),(261,2,'eoスポット',''),(262,2,'モバイルポイント',''),(263,2,'Air11',''),(264,2,'みあこネット',''),(265,2,'フリー無線スポット',''),(266,1,'車・ドライブ',''),(267,2,'レンタカー',''),(268,2,'ガソリンスタンド',''),(269,2,'カー用品店',''),(270,2,'カーディーラー',''),(271,2,'整備工場',''),(272,2,'洗車場',''),(273,2,'中古車販売',''),(274,2,'道の駅',''),(275,2,'駐車場',''),(276,2,'その他(車・ドライブ)',''),(277,1,'冠婚葬祭・その他',''),(278,2,'キリスト教・修道院',''),(279,2,'霊園',''),(280,2,'神社・寺',''),(281,2,'結婚式場',''),(282,2,'葬儀場',''),(283,2,'その他',''),(284,2,'文化財',''),(285,3,'国宝',''),(286,3,'重要文化財',''),(287,3,'特別史跡',''),(288,3,'史跡',''),(289,3,'天然記念物',''),(290,3,'重要有形民俗文化財',''),(291,3,'重要無形民俗文化財',''),(292,3,'無形民俗文化財',''),(293,3,'保護文化財',''),(294,3,'国登録有形文化財',''),(295,3,'無形文化財',''),(296,3,'有形民俗文化財',''),(298,2,'不明',''),(297,1,'不明','');
/*!40000 ALTER TABLE `class` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2015-04-22 17:36:02
